RoboEvangelist/TivaWare_C_Series-2.1.0.12573/examples/boards/ek-tm4c1294xl-boost-cc3000/cc3000_basic_wifi_application/cc3000_basic_wifi_application.c
}

//*****************************************************************************
//
// Open a UDP or TCP socket.
// Arguments:
// [1] 'TCP' or 'UDP' to specify socket type
//
//*****************************************************************************
int
CMD_socketOpen(int argc, char **argv)
{
    int32_t i32Check = 0;

    //
    // Validate input.
    //
    if(argc < 2)
    {
        UARTprintf("    Please specify socket type, 'TCP' or 'UDP'\n");
        return(CMDLINE_TOO_FEW_ARGS);
    }
    else if(argc > 2)
    {
        return(CMDLINE_TOO_MANY_ARGS);
    }
    else if( (g_ui32CC3000DHCP == 0) || (g_ui32CC3000Connected == 0) )
    {
        UARTprintf("    Please connect to a network before opening a socket.");
        UARTprintf("\n");
        return(CMDLINE_BAD_CMD);
    }
    else if(argc == 2)
    {
        if((argv[1][0] != 'u') && (argv[1][0] != 'U') &&
           (argv[1][0] != 't') && (argv[1][0] != 'T')   )
        {
            UARTprintf("    Please provide Type of Socket 'UDP' or 'TCP' .\n");
            return(CMDLINE_INVALID_ARG);
        }
    }

    //
    // Reset global socket type holder.
    //
    g_ui32SocketType = 0;

    //
    // Socket is of type UDP.
    //
    if((argv[1][0] == 'U') || (argv[1][0] == 'u'))
    {
        //
        // Open Socket.
        //
        i32Check = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);

        //
        // Set global variable that holds type of socket.
        //
        g_ui32SocketType = IPPROTO_UDP;

        //
        // Inform user of the socket being opened.
        //
        UARTprintf("    Socket is of type UDP\n");
    }

    //
    // Socket is of type TCP.
    //
    else if((argv[1][0] == 't') || (argv[1][0] == 'T'))
    {
        //
        // Open Socket.
        //
        i32Check = socket(AF_INET, SOCK_DGRAM, IPPROTO_TCP);

        //
        // Set global variable that holds type of socket.
        //
        g_ui32SocketType = IPPROTO_TCP;

        //
        // Inform user of the socket being opened.
        //
        UARTprintf("    Socket is of type TCP\n");
    }

    //
    // Error Checking.
    //
    if(i32Check >= 0)
    {
        UARTprintf("    Socket Handle is '%d'\n",i32Check);
        g_ui32Socket = i32Check;
        return(0);
    }
    else
    {
        UARTprintf("    Socket Function returned an error."
                    "   Socket not opened on error code '%d'.\n",i32Check);
        g_ui32SocketType = 0;
        return(0);
    }
}

//*****************************************************************************
//
// Close the open socket.
// Arguments: None
//
//*****************************************************************************
int
CMD_socketClose(int argc, char **argv)
{
    uint32_t ui32Check;

    //
    // Shut down open socket connection for TCP
    //
    g_bSocketConnected = false;

    //
    // Close Socket
    //
    ui32Check = closesocket(g_ui32Socket);

    //
    // Error Checking
    //
    if(COMMAND_SUCCESS == ui32Check)
    {
        UARTprintf("    Socket Closed Successfully.\n");
        g_ui32Socket = SENTINEL_EMPTY;
        return(COMMAND_SUCCESS);
    }
    else
    {
        UARTprintf("    Socket Close Failed.\n");
    }
    return(0);
}

//*****************************************************************************
//
// Send Data to a destination port at a given IP Address.
// Arguments:
// [1] IP Address in the form xxx.XXX.yyy.YYY
// [2] Port as an integer 0->65536
// [3] Data to send as a string, <255bytes, no spaces
//
//*****************************************************************************
int
CMD_sendData(int argc, char **argv)
{
    int32_t i32Check = 0;
    char * pui8Data;
    uint32_t ui32DataLength, ui32Port;
    uint8_t ui8IPBlock1,ui8IPBlock2,ui8IPBlock3,ui8IPBlock4;

    //
    // Extract IP Address.
    //
    i32Check = DotDecimalDecoder(argv[1],&ui8IPBlock1,&ui8IPBlock2,&ui8IPBlock3,
                                    &ui8IPBlock4);

    //
    // Validate Input.
    //
    if(g_ui32Socket == SENTINEL_EMPTY)
    {
        UARTprintf("    Please Open a socket before tying this command.\n");
        return(CMDLINE_INVALID_ARG);
    }
    else if(argc < 4)
    {
        return(CMDLINE_TOO_FEW_ARGS);
    }
    else if(argc > 4)
    {
        return(CMDLINE_TOO_MANY_ARGS);
    }
    //
    // Validate Message Size, between 1-1460 bytes.
    //
    else if( (strlen(argv[3]) > 1460) || (strlen(argv[3]) < 1) )
    {
        UARTprintf("Invalid Message, must send 1-1460 bytes\n");
        return(CMDLINE_INVALID_ARG);
    }
    //
    // Validate Port is 0->255.
    //
    else if( ustrtoul(argv[2],0,10) > (65536))
    {
        UARTprintf("    Port must be 0->65536\n");
        return(CMDLINE_INVALID_ARG);
    }
    //
    // Check return value of dot decimal converter.
    //
    else if(i32Check == COMMAND_FAIL)
    {
        UARTprintf("    Invalid IP Address. Valid IP is 0.0.0.0 -> "
                    "255.255.255.255\n");
        return(CMDLINE_INVALID_ARG);
    }

    //
    // Data pointer.
    //
    pui8Data = argv[3];

    //
    // Data length to send.
    //
    ui32DataLength = strlen(argv[3]);

    //
    // The family is always AF_INET on CC3000.
    //
    g_tSocketAddr.sa_family = AF_INET;

    //
    // The destination port.
    //
    ui32Port = ustrtoul(argv[2],0,10);
    g_tSocketAddr.sa_data[0] = (ui32Port & 0xFF00) >> 8;
    g_tSocketAddr.sa_data[1] = (ui32Port & 0x00FF) >> 0;

    //
    // The destination IP address.
    //
    g_tSocketAddr.sa_data[2] = ui8IPBlock1;
    g_tSocketAddr.sa_data[3] = ui8IPBlock2;
    g_tSocketAddr.sa_data[4] = ui8IPBlock3;
		// last byte is the server's (the one receiving the data)
    g_tSocketAddr.sa_data[5] = ui8IPBlock4;

    //
    // Call low level send Function.
    //
    if(g_ui32SocketType == IPPROTO_UDP)
    {
        //
        // Send UDP packet.
        //
        UARTprintf("    Sending UDP Packet...\n");
        i32Check = sendto(g_ui32Socket, pui8Data, ui32DataLength, 0,
                            &g_tSocketAddr,sizeof(sockaddr));
    }
    else if(g_ui32SocketType == IPPROTO_TCP)
    {
        //
        // Connect to TCP Socket on Server (if not already conneted)
        //
	/*		
        if(g_bSocketConnected == false)
        {
            UARTprintf("    Connecting to TCP Socket on Server...\n");
            i32Check = connect(g_ui32Socket, &g_tSocketAddr, sizeof(sockaddr));
            if(i32Check != 0)
            {
                UARTprintf("    Connect failed with error code '%d'\n", i32Check);
                UARTprintf("    Please make sure there is a server with the "
                           "specified socket open to connect to\n");
                return(0);
            }
            else
            {
                //
                // Socket connected successfully
                //
                g_bSocketConnected = true;
            }
        }
*/
        //
        // Send TCP Packet.
        //
        UARTprintf("    Sending TCP Packet...\n");
        i32Check = send(g_ui32Socket, pui8Data, ui32DataLength, 0);
    }

    //
    // Validate completion of send.
    //
    if(i32Check == -1)
    {
        UARTprintf("    Send Data Failed with code '%d'\n",i32Check);
    }
    else
    {
        UARTprintf("    Send Data Success: sent %d bytes.\n", i32Check);
    }

    return(0);
}

//*****************************************************************************
//
// Receives data from the opened socket on the binded port. Prints received
// data to the terminal.
//
// Arguments: None
//
// Requires SocketOpen and Bind to have been previously called.
//
//*****************************************************************************
int
CMD_receiveData(int argc, char **argv)
{
    int32_t i32ReturnValue;
    socklen_t tRxPacketLength;
    uint32_t ui32x = 0, ui32Count = 0;
    bool bRunOnce = true;
		int BUFFER_SIZE = 100;
		char send_data[BUFFER_SIZE];
		unsigned long sensor_reading = 0;
		bool obstacleInFront = false;

    //
    // Validate Input.
    //
    if((g_ui32Socket == SENTINEL_EMPTY) || g_ui32BindFlag == SENTINEL_EMPTY)
    {
        UARTprintf("    Please Open a socket and Bind it to a port before "
                   "receiving data.\n");
        return(CMDLINE_BAD_CMD);
    }

    //
    // Receive TCP data.
    //
    else if(g_ui32SocketType == IPPROTO_TCP)
    {
        //
        // We've been asked to receive a TCP packet.
        //
        UARTprintf("    Looking for TCP Packets...\n");

        //
        // Get all data received.  This may require multiple calls.
        //
        do
        {
            //
            // Get Data
            //
            i32ReturnValue = recv(g_ui32Socket, g_pui8CC3000_Rx_Buffer,
                                  CC3000_APP_BUFFER_SIZE, 0);
					
					 if(i32ReturnValue > 4)    // get into autonomous mode
					 {
							if(g_pui8CC3000_Rx_Buffer[0] == 'a' && g_pui8CC3000_Rx_Buffer[1] == 'u' &&
									g_pui8CC3000_Rx_Buffer[2] == 't' && g_pui8CC3000_Rx_Buffer[3] == 'o' &&
									g_pui8CC3000_Rx_Buffer[4] == '1')
							{	
								UARTprintf(" \n autonomous mode on...\n");
								autonomousMode = true;
							}
							else
							{
								UARTprintf(" \n autonomous mode of...\n");
								autonomousMode = false;
								STOP();    // stop the robot and center the wheels in the front
							}
						}
						else if(i32ReturnValue == 4)
						{
//							if(g_pui8CC3000_Rx_Buffer[0] == 'S' && g_pui8CC3000_Rx_Buffer[1] == 'T' &&
//									g_pui8CC3000_Rx_Buffer[2] == 'O' && g_pui8CC3000_Rx_Buffer[3] == 'P')
//							{
								UARTprintf(" stopping...\n");
								STOP();
//							}
						}
						else if(i32ReturnValue==3)
						{
							if(g_pui8CC3000_Rx_Buffer[0] == 'L' && g_pui8CC3000_Rx_Buffer[1] == 'F' &&
									g_pui8CC3000_Rx_Buffer[2] == '1')
							{
								UARTprintf(" LF1 checked\n");
								LForward1();
							}
							else if(g_pui8CC3000_Rx_Buffer[0] == 'L' && g_pui8CC3000_Rx_Buffer[1] == 'F' &&
									g_pui8CC3000_Rx_Buffer[2] == '2')
							{
								UARTprintf("LF2 checked...\n");
								LForward2();
							}
							else if(g_pui8CC3000_Rx_Buffer[0] == 'L' && g_pui8CC3000_Rx_Buffer[1] == 'B' &&
									g_pui8CC3000_Rx_Buffer[2] == '1')
							{
								UARTprintf("    LB1 checked\n");
								LBackward1();
							}
							else if(g_pui8CC3000_Rx_Buffer[0] == 'L' && g_pui8CC3000_Rx_Buffer[1] == 'B' &&
									g_pui8CC3000_Rx_Buffer[2] == '2')
							{
								UARTprintf("    LB2 checked\n");
								LBackward2();
							}
							else if(g_pui8CC3000_Rx_Buffer[0] == 'R' && g_pui8CC3000_Rx_Buffer[1] == 'F' &&
									g_pui8CC3000_Rx_Buffer[2] == '1')
							{
								UARTprintf("    RF1 checked\n");
								RForward1();
							}
							else if(g_pui8CC3000_Rx_Buffer[0] == 'R' && g_pui8CC3000_Rx_Buffer[1] == 'F' &&
									g_pui8CC3000_Rx_Buffer[2] == '2')
							{
								UARTprintf("    RF2 checked\n");
								RForward2();
							}
							else if(g_pui8CC3000_Rx_Buffer[0] == 'R' && g_pui8CC3000_Rx_Buffer[1] == 'B' &&
									g_pui8CC3000_Rx_Buffer[2] == '1')
							{
								UARTprintf("    RB1 checked\n");
								RBackward1();
							}
							else if(g_pui8CC3000_Rx_Buffer[0] == 'R' && g_pui8CC3000_Rx_Buffer[1] == 'B' &&
									g_pui8CC3000_Rx_Buffer[2] == '2')
							{
								UARTprintf("    RB2 checked\n");
								RBackward2();
							}
						}
						else if(i32ReturnValue==2)
						{
							if(g_pui8CC3000_Rx_Buffer[0] == 'F' && g_pui8CC3000_Rx_Buffer[1] == '1') //SW1 is pressed//(count==0)	//
							{
								UARTprintf(" moving Forward F1...\n");
								Forward1();
							}
							//else if(strcmp(g_pui8CC3000_Rx_Buffer,"F2")==0)//(count==1)	//		//sw2 is pressed
							else if (g_pui8CC3000_Rx_Buffer[0] == 'F' && g_pui8CC3000_Rx_Buffer[1] == '2')
							{
								UARTprintf("    F2 checked\n");
								Forward2();
							}
							else if(g_pui8CC3000_Rx_Buffer[0] == 'B' && g_pui8CC3000_Rx_Buffer[1] == '1')//(c==B1)//(count==3)								//
							{
								UARTprintf("    B1 checked\n");
								Backward1();
							}
							else if(g_pui8CC3000_Rx_Buffer[0] == 'B' && g_pui8CC3000_Rx_Buffer[1] == '2')//(c==B2)//(count==4)		//		//sw2 is pressed
							{
								UARTprintf("    B2 checked\n");
								Backward2();
							}
						}
						else
						{
							UARTprintf(" stopping...\n");
							STOP();	
							//						
						}

            //
            // Check Data Validity
            //
            if(bRunOnce && (0 >= i32ReturnValue))
            {
                //
                // No data received on first try.
                //
                UARTprintf("    No data received.\n");
								socket_opened = false;
                return(0);
            }

            //
            // Print data to screen.
            //
/*            if(bRunOnce)
            {
                UARTprintf("    Received %d bytes of data: \n    '",
                            i32ReturnValue);
            }    */
						//UARTprintf("\n\nSensor Value: %d\n\n    '", ADC0_InSeq3());
/*            for(ui32x = 0; ui32x < i32ReturnValue; ui32x++, ui32Count++)
            {
                //
                // Add column wrapping to make output pretty.
                //
                if( ((ui32Count % 60) == 0) && (ui32Count > 0))
                {
                    UARTprintf("\n    ");
                }

                //
                // Print text to screen
                //
                UARTprintf("%c", g_pui8CC3000_Rx_Buffer[ui32x]);
            }   */
            //bRunOnce = false;
				
